-- MySQL dump 10.13  Distrib 9.2.0, for Win64 (x86_64)
--
-- Host: localhost    Database: nmt_bot_db
-- ------------------------------------------------------
-- Server version	9.2.0

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `dates`
--

DROP TABLE IF EXISTS `dates`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `dates` (
  `id` int NOT NULL AUTO_INCREMENT,
  `date` varchar(100) COLLATE utf8mb4_unicode_ci NOT NULL,
  `event` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `topic_id` int DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `topic_id` (`topic_id`),
  CONSTRAINT `dates_ibfk_1` FOREIGN KEY (`topic_id`) REFERENCES `topics` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=149 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `dates`
--

LOCK TABLES `dates` WRITE;
/*!40000 ALTER TABLE `dates` DISABLE KEYS */;
INSERT INTO `dates` VALUES (1,'1556-1561 рр.','Створення Пересопницького Євангелiя',1),(2,'1556 р.','Заснування князем Дмитром Вишневецьким на о. Мала Хортиця першої вiдомої Сiчi',1),(3,'1569 р.','Люблiнська унiя: утворення Речi Посполитої',1),(4,'1586 р.','Утворення першої братської (слов\'яно-греко-латинської) школи у м. Львiв',1),(5,'1596 р.','Берестейська церковна унiя: утворення Української греко-католицької церкви (УГКЦ)',1),(6,'1618 р.','Похiд козакiв пiд проводом гетьмана Петра Конашевича-Сагайдачного на м. Москва',2),(7,'1621 р.','Хотинська битва',2),(8,'1625 р.','Курукiвська угода',2),(9,'1632 р.','\"Пункти для заспокоєння руського народу\"',2),(10,'1637-1638 рр.','Повстання пiд проводом Павла Павлюка, Якова Острянина, Дмитра Гунi',2),(11,'1648 р.','Жовтоводська, Корсунська та Пилявецька битви',3),(12,'1649 р.','Зборiвська битва. Зборiвський договiр',3),(13,'1651 р.','Берестецька битва. Бiлоцеркiвський договiр',3),(14,'1652 р.','Батозька битва',3),(15,'1653 р.','Жванецька облога. Кам`янецький договiр',3),(16,'1654 р.','Переяславська рада, українсько-московський договiр (\"Березневi статтi\")',3),(17,'1656 р.','Московсько-польське Вiленське перемир`я',3),(18,'1658 р.','Гадяцький договiр',4),(19,'1659 р.','Конотопська битва',4),(20,'1667 р.','Андрусiвське перемир`я',4),(21,'1669 р.','Корсунська угода, визнання Правобережною Гетьманщиною протекторату Османської iмперiї',4),(22,'1681 р.','Бахчисарайський мирний договiр',4),(23,'1686 р.','\"Вiчний мир\" мiж Московським царством i Рiччю Посполитою',4),(24,'1708 р.','Українсько-шведський союз, зруйнування Батурина',5),(25,'1709 р.','Зруйнування московитськими вiйськами Чортомлицької Сiчi',5),(26,'1710 р.','\"Конституцiя...\"  Пилипа Орлика',5),(27,'1713 р.','Лiквiдацiя козацтва на Правобережнiй Українi',5),(28,'1734 р.','Заснування Нової (Пiдпiльненської) Сiчi',5),(29,'1764 р.','Остаточна лiквiдацiя посади гетьмана',6),(30,'1768 р.','Колiївщина',6),(31,'1775 р.','Остаточна лiквiдацiя Запорiзької Сiчi',6),(32,'1780-1782 рр.','Лiквiдацiя особистої залежностi селян в Австрiйськiй iмперiї',6),(33,'1783 р.','Закрiпачення селян Лiвобережної та Слобiдської України',6),(34,'1798 р.','Видання \"Енеїди\" i. Котляревського',7),(35,'Грудень 1825 - сiчень 1826 рр.','Повстання Чернiгiвського полку',7),(36,'1828 р.','Лiквiдацiя Задунайської Сiчi',7),(37,'1830-1831 рр.','Польське визвольне повстання',7),(38,'1840 р.','Перше видання \"Кобзаря\" Тараса Шевченка',7),(39,'1846-1847 рр.','Дiяльнiсть Кирило-Мефодiївського братства',7),(40,'1816 р.','Створення освiтнього товариства галицьких греко-католицьких священикiв',8),(41,'1833-1837 рр.','Дiяльнiсть \"Руської Трiйцi\"',8),(42,'1837 р.','Видання \"Русалки Днiстрової\"',8),(43,'1848 р.','Скасування панщини в Галичинi',8),(44,'1848 р.','Створення Головної Руської Ради',8),(45,'1848 р.','Видання першої української газети \"Зоря Галицька\"',8),(46,'1805 р.','Вiдкриття унiверситету в м. Харкiв',9),(47,'1834 р.','Вiдкриття унiверситету в м. Київ',9),(48,'1839 р.','Лiквiдацiя царською владою греко-католицької церкви на Правобережжi',9),(49,'19 лютого 1861 р.','Царський манiфест про скасування крiпосного права в Росiйськiй iмперiї',10),(50,'1863 р.','Валуєвський циркуляр',10),(51,'1863-1864 рр.','Польське нацiонально-визвольне повстання',10),(52,'1876 р.','Емський указ',10),(53,'1868 р.','Створення у м. Львiв товариства \"Просвiта\"',11),(54,'1873 р.','Створення у м. Львiв Лiтературного товариства iменi Тараса Шевченка',11),(55,'1890 р.','Створення Русько-української радикальної партiї',11),(56,'1899 р.','Створення Української нацiонально-демократичної партiї та Української соцiал-демократичної партiї',11),(57,'1865 р.','Вiдкриття Новоросiйського унiверситету',12),(58,'1875 р.','Вiдкриття Чернiвецького унiверситету',12),(59,'1900 р.','Створення Революцiйної української партiї (РУП)',13),(60,'1905 р.','Створення першої в Надднiпрянськiй Українi \"Просвiти\"',13),(61,'1908 р.','Створення Товариства українських поступовцiв (ТУП)',13),(62,'1900 р.','Обрання Андрея Шептицького митрополитом УГКЦ',14),(63,'1907 р.','Впровадження в Австро-Угорськiй iмперiї загального виборчого права для чоловiкiв',14),(64,'Серпень 1914 р.','Утворення Головної української ради',15),(65,'1914 р.','Галицька битва',15),(66,'1915 р.','Утворення Загальної української ради',15),(67,'1916 р.','Брусиловський прорив',15),(68,'Березень 1917 р.','Утворення Української Центральної Ради (УЦР)',16),(69,'Квiтень 1917 р.','Всеукраїнський нацiональний конгрес',16),(70,'Червень 1917 р.','I Унiверсал УЦР',16),(71,'Липень 1917 р.','II Унiверсал УЦР',16),(72,'Листопад 1917 р.','III Унiверсал УЦР',16),(73,'9 (22) сiчня 1918 р.','IV Унiверсал УЦР, проголошення незалежностi Української Народної Республiки (УНР)',16),(74,'Сiчень 1918 р.','Бiй бiля станцiї Крути',16),(75,'Сiчень (лютий) 1918 р.','Брестський мирний договiр мiж УНР та державами Четвертного союзу',16),(76,'29 квiтня 1918 р.','Державний переворот i прихiд до влади Павла Скоропадського',17),(77,'1 листопада 1918 р.','\"Листопадовий зрив\" у Львовi',17),(78,'13 листопада 1918 р.','Проголошення Захiдноукраїнської Народної Республiки (ЗУНР)',17),(79,'Листопад 1918 р.','Заснування Української академiї наук (УАН)',17),(80,'14 листопада 1918 р.','Утворення Директорiї',17),(81,'22 сiчня 1919 р.','Проголошення Акта Злуки УНР та ЗУНР',17),(82,'Грудень 1919 - травень 1920 рр.','Перший Зимовий похiд армiї УНР',17),(83,'Квiтень 1920 р.','Варшавська угода',17),(84,'Березень 1921 р.','Ризький мирний договiр',17),(85,'1921 р.','Утворення Української автокефальної православної церкви (УАПЦ)',17),(86,'Листопад 1921 р.','Другий Зимовий похiд армiї УНР',17),(87,'1921-1923 рр.','Масовий голод в Українi',18),(88,'1922 р.','Входження УСРР до складу Союзу Радянських Соцiалiстичних Республiк (СРСР)',18),(89,'1923 р.','Початок полiтики коренiзацiї/українiзацiї в УСРР',18),(90,'1925 р.','Проголошення курсу на iндустрiалiзацiю',18),(91,'1928/1929-1932 рр.','Перша п`ятирiчка',19),(92,'1928 р.','Судовий процес у Шахтинськiй справi',19),(93,'1929 р.','Початок насильницької колективiзацiї',19),(94,'1930 р.','Судовий процес у справi Спiлки визволення України (СВУ)',19),(95,'1932-1933 рр.','Голодомор в Українi',19),(96,'1934 р.','Перенесення столицi УСРР з Харкова до Києва',19),(97,'1937 р.','Ухвалення Конституцiї УРСР',19),(98,'1937-1938 рр.','\"Великий терор\"',19),(99,'1920 р.','Пiдписання Бессарабського протоколу, визнання країнами Антанти входження Бессарабiї до складу Румунiї',20),(100,'1923 р.','Визнання країнами Антанти входження Схiдної Галичини до складу Польщi',20),(101,'1925 р.','Утворення Українського нацiонально-демократичного об`єднання (УНДО)',20),(102,'1929 р.','Утворення Органiзацiї українських нацiоналiстiв (ОУН)',20),(103,'1930 р.','Проведення польською владою акцiї \"пацифiкацiї\"',20),(104,'1938 р.','Надавання автономiї Пiдкарпатськiй Русi у складi Чехо-Словаччини',20),(105,'15 березня 1939 р.','Проголошення незалежностi Карпатської України',20),(106,'23 серпня 1939 р.','Радянсько-нiмецький договiр про ненапад i таємний протокол до нього (\"пакт Молотова-Рiббентропа\")',21),(107,'1 вересня 1939 р.','Початок Другої свiтової вiйни',21),(108,'17 вересня 1939 р.','Вторгнення Червоної армiї на територiю Захiдної України',21),(109,'Червень 1940 р.','Вторгнення Червоної армiї на територiю Бессарабiї та Пiвнiчної Буковини',21),(110,'22 червня 1941 р.','Напад Нiмеччини на СРСР',21),(111,'30 червня 1941 р.','Проголошення Акта вiдновлення Української Держави',21),(112,'14 жовтня 1942 р.','Створення Української повстанської армiї (УПА)',21),(113,'Грудень 1942 р.','Початок вигнання нiмецьких вiйськ та їх союзникiв з України',21),(114,'6 листопада 1943 р.','Вигнання нiмецьких окупантiв з м. Київ',21),(115,'Сiчень-лютий 1944 р.','Корсунь-Шевченкiвська наступальна операцiя',21),(116,'28 жовтня 1944 р.','Завершення вигнання нiмецьких вiйськ та їх союзникiв з територiї України',21),(117,'9 травня 1945 р.','День Перемоги над нацизмом у Другiй свiтовiй вiйнi',21),(118,'2 вересня 1945 р.','Завершення Другої свiтової вiйни',21),(119,'1945 р.','Входження Закарпаття до складу УРСР',22),(120,'Квiтень 1945 р.','Україна - спiвзасновниця Органiзацiї Об`єднаних Нацiй (ООН)',22),(121,'Березень 1946 р.','Лiквiдацiя УГКЦ',22),(122,'1946-1947 рр.','Масовий голод в Українi',22),(123,'Квiтень-липень 1947 р.','Проведення польською владою операцiї \"Вiсла\"',22),(124,'Жовтень 1947 р.','Проведення операцiї \"Захiд\"',22),(125,'1951 р.','Встановлення захiдного кордону УРСР',22),(126,'1953-1954 рр.','Повстання полiтичних в`язнiв у сталiнських концтаборах. Лiквiдацiя ГУТабу',23),(127,'Лютий 1954 р.','Входження Кримської областi до складу УРСР',23),(128,'1956 р.','ХХ з`їзд КПРС, засудження культу особи',23),(129,'1959 р.','Утворення Української робiтничо-селянської спiлки',23),(130,'1959 р.','Утворення Клубу творчої молодi \"Сучасник\" у м. Київ',23),(131,'1965 р.','Перша хвиля масових затримань дiячiв анти режимного руху',24),(132,'1970-1972 рр.','Видання самвидавного \"Українського вiсника\"',24),(133,'1972 р.','Друга хвиля масових затримань дiячiв анти режимного руху',24),(134,'1976 р.','Утворення Української громадської групи сприяння виконанню Гельсiнських угод (УГГ)',24),(135,'Квiтень 1985 р.','Початок \"перебудови\"',25),(136,'26 квiтня 1986 р.','Катастрофа на Чорнобильськiй атомнiй електростанцiї (АЕС)',25),(137,'Вересень 1989 р.','Створення Народного руху Українi за перебудову',25),(138,'Березень 1990 р.','Проведення перших альтернативних виборiв до Верховної Ради УРСР',25),(139,'16 липня 1990 р.','Ухвалення Верховною Радою УРСР Декларацiї про Державний суверенiтет України',25),(140,'Жовтень 1990 р.','\"Революцiя на гранiтi\"',25),(141,'24 серпня 1991 р.','Ухвалення Верховною Радою УРСР Акта проголошення незалежностi України',25),(142,'1 грудня 1991 р.','Проведення Всеукраїнського референдуму та обрання Президента України',25),(143,'6 грудня 1991 р.','Заснування Збройних Сил України',26),(144,'Липень 1994 р.','Обрання Леонiда Кучми Президентом України',26),(145,'1995 р.','Обрання України членом Ради Європи (РЄ)',26),(146,'28 червня 1996 р.','Ухвалення Конституцiї України',26),(147,'Вересень 1996 р.','Запровадження нацiональної грошової одиницi - гривнi',26),(148,'Жовтень-грудень 2004 р.','\"Помаранчева революцiя\", обрання Президентом України Вiктора Ющенка',26);
/*!40000 ALTER TABLE `dates` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `results`
--

DROP TABLE IF EXISTS `results`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `results` (
  `id` int NOT NULL AUTO_INCREMENT,
  `is_bytheme` tinyint(1) NOT NULL,
  `chat_id` bigint NOT NULL,
  `topic_id` int DEFAULT NULL,
  `date` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `correct_answers` int NOT NULL,
  `incorrect_answers` int NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `results`
--

LOCK TABLES `results` WRITE;
/*!40000 ALTER TABLE `results` DISABLE KEYS */;
INSERT INTO `results` VALUES (1,0,653020506,NULL,'2025-03-18 10:53:04',9,17),(2,1,653020506,1,'2025-03-18 10:57:54',2,3),(3,0,266879656,NULL,'2025-03-18 18:27:01',8,18),(4,1,266879656,3,'2025-03-18 18:29:14',0,7),(5,1,653020506,1,'2025-03-18 19:00:30',5,0),(6,1,653020506,3,'2025-03-18 19:05:20',2,5);
/*!40000 ALTER TABLE `results` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `topics`
--

DROP TABLE IF EXISTS `topics`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `topics` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=28 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `topics`
--

LOCK TABLES `topics` WRITE;
/*!40000 ALTER TABLE `topics` DISABLE KEYS */;
INSERT INTO `topics` VALUES (1,'6. Українськi землi у складi Речi Посполитої в другiй половинi ХVI ст.'),(2,'7. Українськi землi в складi Речi Посполитої в першiй половинi XVII ст.'),(3,'8. Нацiонально-визвольна вiйна українського народу середини XVII ст.'),(4,'9. Козацька Україна наприкiнцi 50 - 80-х рр. XVII ст.'),(5,'10. Українськi землi наприкiнцi XVII - в першiй половинi XVIII ст.'),(6,'11. Українськi землi в другiй половинi XVIII ст.'),(7,'12. Українськi землi у складi Росiйської iмперiї наприкiнцi XVIII - в першiй половинi XIX ст.'),(8,'13. Українськi землi у складi Австрiйської iмперiї наприкiнцi XVIII - в першiй половинi XIX ст.'),(9,'14. Культура України кiнця XVIII - першої половинi XIX ст.'),(10,'15. Українськi землi у складi Росiйської iмперiї в другiй половинi XIX ст.'),(11,'16. Українськi землi у складi Австро-Угорщини в другiй половинi XIX ст.'),(12,'17. Культура України в другiй половинi XIX - на початку XX ст.'),(13,'18. Українськi землi у складi Росiйської iмперiї в 1900-1914 рр.'),(14,'19. Українськi землi у складi Австро-Угорщини в 1900-1914 рр.'),(15,'20. Україна в роки Першої свiтової вiйни'),(16,'21. Початок Української Революцiї'),(17,'22. Розгортання Української революцiї. Боротьба за вiдновлення державностi'),(18,'23. Встановлення комунiстичного тоталiтарного режиму в Українi'),(19,'24. Утвердження бiльшовицького тоталiтарного режиму в Українi'),(20,'25. Захiдноукраїнськi землi в мiжвоєнний перiод'),(21,'26. Україна в роки Другої свiтової вiйни'),(22,'27. Україна в першi повоєннi роки'),(23,'28. Україна в умовах десталiнiзацiї'),(24,'29. Україна в перiод загострення кризи радянської системи'),(25,'30. Вiдновлення незалежностi України'),(26,'31. Становлення України як незалежної держави'),(27,'32. Творення нової України');
/*!40000 ALTER TABLE `topics` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-03-18 22:41:12
